Tekla Open API Reference for Tekla Structures 2025
GraphicObjectHatchAttributes Class
 The GraphicObjectHatchAttributes class contains hatch attributes for graphic object hatches.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.GenericAttributesBase
 Tekla.Structures.Drawing.HatchAttributes
 Tekla.Structures.Drawing.GraphicObjectHatchAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class GraphicObjectHatchAttributes : HatchAttributes
<SerializableAttribute>
Public NotInheritable Class GraphicObjectHatchAttributes
	Inherits HatchAttributes
The GraphicObjectHatchAttributes type exposes the following members.
Properties
Name | Description
Angle
 The angle in which to draw the hatch.
 (Inherited from HatchAttributes.)
BackgroundColor
 The background color of the hatch.
 (Inherited from HatchAttributes.)
Color
 The color of the hatch.
 (Inherited from HatchAttributes.)
DrawBackgroundColor
 Sets whether the background color will be enabled or disabled for the hatch. See also: BackgroundColor.
 (Inherited from HatchAttributes.)
FactorType
 The type of the hatch factor.
 (Inherited from HatchAttributes.)
Name
 The name of the hatch. If an empty string is given as hatch name it will become "None".
 (Inherited from HatchAttributes.)
OffsetX
 The offset from the origin in the X-direction.
OffsetY
 The offset from the origin in the Y-direction.
ScaleX
 The scale value of the hatch in the X-direction.
 (Inherited from HatchAttributes.)
ScaleY
 The scale value of the hatch in the Y-direction.
 (Inherited from HatchAttributes.)
TrueBackgroundColor
 The true color (rgb enabled) of the hatch background.
 (Inherited from HatchAttributes.)
TrueColor
 The true color (RGB enabled) of the hatch.
 (Inherited from HatchAttributes.)
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides GenericAttributesBase.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace